---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWall
source: html/7952f3bf-211e-f591-69b3-dc94258a7977.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostWall Property

Rebar Cover Interior and Exterior are too large for host.

## Syntax (C#)
```csharp
public static FailureDefinitionId ThinHostWall { get; }
```